lexi6725/FreeRTOS/BSP/STM32F103ZE/stm3210e_bit3.c
	/* EEPROM_CS_GPIO Periph clock enable */
	nRF_SPI_CS_GPIO_CLK_ENABLE();

	/* Configure EEPROM_CS_PIN pin: EEPROM SPI CS pin */
	gpioinitstruct.Pin    = nRF_SPI_CS_PIN|nRF_CSN_PIN;
	gpioinitstruct.Mode   = GPIO_MODE_OUTPUT_PP;
	gpioinitstruct.Pull   = GPIO_PULLUP;
	gpioinitstruct.Speed  = GPIO_SPEED_HIGH;
	HAL_GPIO_Init(nRF_SPI_CS_GPIO_PORT, &gpioinitstruct);

	gpioinitstruct.Pin	= nRF_IRQ_PIN;
	gpioinitstruct.Mode	= GPIO_MODE_IT_FALLING;
	gpioinitstruct.Pull	= GPIO_NOPULL;
	gpioinitstruct.Speed	= GPIO_SPEED_HIGH;
	HAL_GPIO_Init(nRF_SPI_CS_GPIO_PORT, &gpioinitstruct);

	/* Enable and set Eval EXTI2(PA2) Interrupt to the highest priority */
    HAL_NVIC_SetPriority(EXTI2_IRQn, 5, 1);
    HAL_NVIC_EnableIRQ(EXTI2_IRQn);
    
	/* SPI nRF Config */
	Status = SPIx_Init();

	/* EEPROM chip select high */
	nRF_SPI_CS_HIGH();
	nRF_CSN_LOW();

	return Status;
}

/**
  * @brief  Write a byte on the nRF SPI.
  * @param  Data: byte to send.
  * @retval None
  */
uint8_t nRF_SPI_IO_WriteReg(uint8_t Reg, uint8_t Data)
{
	uint8_t status;
	/*!< Select the nRF: Chip Select low */
	nRF_SPI_CS_LOW();

	/* Send the Write Reg */
	status = SPIx_ReadWriteByte(Reg);

	/* Send the Write Data */
	SPIx_ReadWriteByte(Data);
	
	/*!< Deselect the nRF: Chip Select High */
	nRF_SPI_CS_HIGH();
	
	return (status);
}

/**
  * @brief  Read a byte from the nRF SPI.
  * @retval uint8_t (The received byte).
  */
uint8_t nRF_SPI_IO_ReadReg(uint8_t Reg)
{
	uint8_t data = 0;
	
	/*!< Select the nRF: Chip Select low */
	nRF_SPI_CS_LOW();

	/* Send Read Reg */
	SPIx_ReadWriteByte(Reg);
	
	/* Get the received data */
	data = SPIx_ReadWriteByte(0xFF);

	/*!< Deselect the nRF: Chip Select High */
	nRF_SPI_CS_HIGH();

	/* Return the shifted data */
	return data;
}

/**
  * @brief  Read data from nRF SPI driver
  * @param  MemAddress: Internal memory address
  * @param  pBuffer: Pointer to data buffer
  * @param  BufferSize: Amount of data to be read
  * @retval HAL_StatusTypeDef HAL Status
  */
uint8_t nRF_SPI_IO_ReadData(uint8_t Reg, uint8_t* pBuffer, uint32_t BufferSize)
{
	uint8_t status;
	/*!< Select the nRF: Chip Select low */
	nRF_SPI_CS_LOW();

	/* Send Read Reg */
	status = SPIx_ReadWriteByte(Reg);
	
	while (BufferSize--) /*!< while there is data to be read */
	{
		/*!< Read a byte from the nRF */
		*pBuffer = SPIx_ReadWriteByte(0XFF);
		/*!< Point to the next location where the byte read will be saved */
		pBuffer++;
	}

	/*!< Deselect the nRF: Chip Select high */
	nRF_SPI_CS_HIGH();

	return status;
}

/**
  * @brief  Write data To nRF SPI driver
  * @param  Reg: Internal memory address
  * @param  pBuffer: Pointer to data buffer
  * @param  BufferSize: Amount of data to be read
  * @retval 	nRF Status
  */
uint8_t nRF_SPI_IO_WriteData(uint8_t Reg, const uint8_t* pBuffer, uint32_t BufferSize)
{
	uint8_t status;
	/*!< Select the nRF: Chip Select low */
	nRF_SPI_CS_LOW();

	/* Send Write Reg */
	status = SPIx_ReadWriteByte(Reg);
	
	while (BufferSize--) /*!< while there is data to be write */
	{
		/*!< Write a byte to the nRF */
		SPIx_ReadWriteByte(*pBuffer);
		/*!< Point to the next location where the byte Write will be Send */
		pBuffer++;
	}

	/*!< Deselect the nRF: Chip Select high */
	nRF_SPI_CS_HIGH();

	return status;
}

#endif /* HAL_SPI_MODULE_ENABLED */

#ifdef HAL_I2C_MODULE_ENABLED
/********************************* LINK I2C TEMPERATURE SENSOR *****************************/
/**
  * @brief  Initializes peripherals used by the I2C  Sensor driver.
  * @retval None
  */
void I2C1_IO_Init(void)
{
  I2Cx_Init();
}

/**
  * @brief  Writes one byte to the HMC5883L.
  * @param  DevAddress: Target device address
  * @param  pBuffer: Pointer to data buffer
  * @param  WriteAddr: TSENSOR's internal address to write to.
  * @param  Length: Number of data to write
  * @retval None
  */
void I2C1_IO_Write(uint16_t DevAddress, uint8_t* pBuffer, uint8_t WriteAddr, uint16_t Length)
{
  I2Cx_WriteBuffer(DevAddress, WriteAddr, I2C_MEMADD_SIZE_8BIT, pBuffer, Length);
}

/**
  * @brief  Reads one byte from the HMC5883L.
  * @param  DevAddress: Target device address
  * @param  pBuffer : pointer to the buffer that receives the data read from the TSENSOR.
  * @param  ReadAddr : TSENSOR's internal address to read from.
  * @param  Length: Number of data to read
  * @retval None
  */
void I2C1_IO_Read(uint16_t DevAddress, uint8_t* pBuffer, uint8_t ReadAddr, uint16_t Length)
{
  I2Cx_ReadBuffer(DevAddress, ReadAddr, I2C_MEMADD_SIZE_8BIT, pBuffer, Length);
}

/**
* @brief  Checks if Temperature Sensor is ready for communication. 
  * @param  DevAddress: Target device address
  * @param  Trials: Number of trials
* @retval HAL status
*/
uint16_t I2C1_IO_IsDeviceReady(uint16_t DevAddress, uint32_t Trials)
{ 
  return (I2Cx_IsDeviceReady(DevAddress, Trials));
}

/********************************* LINK AUDIO ***********************************/

/**
  * @brief  Initializes Audio low level.
  * @retval None
  */
void AUDIO_IO_Init (void) 
{
  GPIO_InitTypeDef  gpioinitstruct = {0};
  
  /* Enable Reset GPIO Clock */
  AUDIO_RESET_GPIO_CLK_ENABLE();

  /* Audio reset pin configuration -------------------------------------------------*/
  gpioinitstruct.Pin   = AUDIO_RESET_PIN; 
  gpioinitstruct.Mode  = GPIO_MODE_OUTPUT_PP;
  gpioinitstruct.Speed = GPIO_SPEED_MEDIUM;
  gpioinitstruct.Pull  = GPIO_NOPULL;
  HAL_GPIO_Init(AUDIO_RESET_GPIO, &gpioinitstruct);    
  
  I2Cx_Init();

  /* Power Down the codec */
  HAL_GPIO_WritePin(AUDIO_RESET_GPIO, AUDIO_RESET_PIN, GPIO_PIN_RESET);

  /* wait for a delay to insure registers erasing */
  HAL_Delay(5); 

  /* Power on the codec */
  HAL_GPIO_WritePin(AUDIO_RESET_GPIO, AUDIO_RESET_PIN, GPIO_PIN_SET);
   
  /* wait for a delay to insure registers erasing */
  HAL_Delay(5); 
}

/**
  * @brief  Writes a single data.
  * @param  Addr: I2C address
  * @param  Reg: Reg address 
  * @param  Value: Data to be written
  * @retval None
  */
void AUDIO_IO_Write (uint8_t Addr, uint8_t Reg, uint8_t Value)
{
  I2Cx_WriteData(Addr, Reg, Value);
}

/**
  * @brief  Reads a single data.
  * @param  Addr: I2C address
  * @param  Reg: Reg address 
  * @retval Data to be read
  */
uint8_t AUDIO_IO_Read (uint8_t Addr, uint8_t Reg)
{
  return I2Cx_ReadData(Addr, Reg);
}

#endif /* HAL_I2C_MODULE_ENABLED */

/**
  * @}
  */ 

/**
  * @}
  */

/**
  * @}
  */    
  
/**
  * @}
  */    
  
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

